In [15]:
import pandas as pd

In [16]:
#define the student data frame
df_student_math = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                                'ID':[10,56,31,85,9,22]})

In [17]:
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],
                                   'ID':[10,12,22]})

In [18]:
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

In [19]:
#merge with key on student
pd.merge(df_student_math, df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [20]:
#merge left join on key ID and also fill NaN values with x
pd.merge(df_student_math, df_student_science, on='ID', how='left').fillna('x')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         x
2       Dan  31         x
3       Ram  85         x
4      Jeff   9         x
5     David  22     David

In [21]:
#concatinate dataFrame
pd.concat([df_student_math, df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [22]:
#define new data frame with student survey data
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                       'ID':[10,56,10,85,9,56]})

In [23]:
#view the data frame
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [24]:
#check for duplicate elements
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [25]:
#drop duplicate values with student as key
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [26]:
#drop duplicate values with ID as key
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9